Dlubal.RFEM5.LoadDirectionType
Direction of load.

Dlubal.RFEM5.LoadDirectionType.UnknownLoadDirectionType
Unknown direction type

Dlubal.RFEM5.LoadDirectionType.GlobalXType
Global direction related to the true member length in X-axis.

Dlubal.RFEM5.LoadDirectionType.GlobalYType
Global direction related to the true member length in Y-axis.

Dlubal.RFEM5.LoadDirectionType.GlobalZType
Global direction related to the true member length in Z-axis.

Dlubal.RFEM5.LoadDirectionType.LocalXType
Local direction related to the true member length in x-axis.

Dlubal.RFEM5.LoadDirectionType.LocalYType
Local direction related to the true member length in y-axis.

Dlubal.RFEM5.LoadDirectionType.LocalZType
Local direction related to the true member length in z-axis.

Dlubal.RFEM5.LoadDirectionType.LocalUType
Local direction related to the true member length in u-axis.

Dlubal.RFEM5.LoadDirectionType.LocalVType
Local direction related to the true member length in v-axis.

Dlubal.RFEM5.LoadDirectionType.ProjectXType
Global direction related to the projected member length in x-axis.

Dlubal.RFEM5.LoadDirectionType.ProjectYType
Global direction related to the projected member length in y-axis.

Dlubal.RFEM5.LoadDirectionType.ProjectZType
Global direction related to the projected member length in z-axis.

Dlubal.RFEM5.LoadDirectionType.PerpendicularZType
Perpendicular to plane in z-axis.